app/views/camps/index.html.erb

SELECT "camps".* FROM "camps"
---
        <td>$<%= camp.fee %></td>
        <td><%= camp.campers.length %></td>