app/controllers/campers_controller.rb

SELECT "campers".* FROM "campers"
---
  def index
    @campers = Camper.all

SELECT  "campers".* FROM "campers" WHERE "campers"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_camper
    @camper = Camper.find(params[:id])