app/controllers/camps_controller.rb

  def index
    @camps = Camp.all
---
SELECT "camps".* FROM "camps"